nxp-mcuxpresso/mcuxsdk-examples/_boards/imx952evk/driver_examples/asrc/asrc_m2m_edma/cm7/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMX9352xxxxM
package_id: MIMX9352DVUXM
mcu_data: ksdk2_0
processor_version: 0.12.3
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO15__LPUART3_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO14__LPUART3_TX, 0U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO15__LPUART3_RX,
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO14__LPUART3_TX,
                        IOMUXC_PAD_DSE(15U));

    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO31__LPI2C4_SCL, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO30__LPI2C4_SDA, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO16__AUDMIX_TDM_OUT_TXBCLK, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO17__SAI3_MCLK, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO20__SAI3_RX_DATA_0, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO21__AUDMIX_TDM_OUT_TXDATA, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO26__AUDMIX_TDM_OUT_TXSYNC, 1U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO31__LPI2C4_SCL,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO30__LPI2C4_SDA,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO16__AUDMIX_TDM_OUT_TXBCLK, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO17__SAI3_MCLK, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO20__SAI3_RX_DATA_0, 
                         IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO21__AUDMIX_TDM_OUT_TXDATA, 
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO26__AUDMIX_TDM_OUT_TXSYNC, 
                        IOMUXC_PAD_DSE(15U));
}
